//===================================================================
// デバッグからリリースへ移行する過程で見直す設定
//===================================================================
設定["コンソールウインドウ表示"] = false;					// 省略時 = false
設定["コンソールウインドウにスクリプト表示"] = true;		// 省略時 = false
設定["音声ファイルが存在しない時にエラー停止"] = false;		// 省略時 = false





//===================================================================
// タイトルやバージョンごとに見直す設定
//===================================================================
設定["キャプション"] = "野外学習3 claude-3-5-sonnet机翻 by ALyCE/jyxjyx1234";							// 省略時 = "PuppetEngine"
設定["キャプションにセーブ情報を表示"] = false;				// 省略時 = false
設定["ブランド名"] = "";									// 省略時 = "StudioRumble"(現状は意味のない設定)
//↓実行ファイルにも $(personalpath) 付きで書き込むこと
設定["フォルダ名"] = "Complets/野外学習3";					// 省略時 = "StudioRumble/PuppetEngine"
//設定["フォルダ名"] = "Complets/野外学習3";					// 省略時 = "StudioRumble/PuppetEngine"
設定["バージョン"] = "1.00";								// 省略時 = "1.00"
設定["ボリュームラベル"] = "";								// 省略時 = ""(ディスクチェックしない)
設定["システム系画面の時にメニューを無効にする"] = true;	// 省略時 = true
設定["レイヤ削除-1除外レイヤリスト"] = [30];

//===================================================================
設定["BGV_switch"] = false;		// 下の行とセットで変更する
@set(BGV_switch = 0)

設定["endpoint_switch"] = true;	// 下の行とセットで変更する
@set(endpoint_switch = 1)

設定["breath_switch"] = false;	// 下の行とセットで変更する
@set(breath_switch = 0)
設定["love_switch"] = false;	// 下の行とセットで変更する
@set(love_switch = 0)

設定["nextvoice_switch"] = false;	// 下の行とセットで変更する
@set(nextvoice_switch = 0)

設定["NotCrossFade_switch"] = false;

設定["character_animation"] = false;	// 下の行とセットで変更する
@set(character_animation = 0)

設定["advanced_grp"] = false;
設定["system_fade_click_skip"] = true;

設定["title_stand_override"] = false;

設定["history_extension"] = true;

設定["cg_flag_ratio"] = false;

// 注意：無効にする場合に 1 を指定する
@set(resolution_select_disabled = 1)

// 注意：無効にする場合に 1 を指定する
設定["cursor_select_disabled"] = true;	// 下の行とセットで変更する
@set(cursor_select_disabled = 1)

// 注意：無効にする場合に 1 を指定する
設定["select_mark_disabled"] = false;	// 下の行とセットで変更する
@set(select_mark_disabled = 0)

設定["saveload_change_switch"] = true;
//===================================================================
設定["cos_button"] = false;
設定["effect_button"] = false;
//===================================================================





//===================================================================
// 特に問題がなければ変えない設定
//===================================================================
設定["画面横幅"] = 1280;									// 省略時 = 800
設定["画面縦幅"] = 720;										// 省略時 = 600

//設定["表示解像度初期番号"] = 1;
//設定["表示解像度横幅リスト"] = [640, 800, 1024, 1280];	// スクエア横幅
//設定["表示解像度縦幅リスト"] = [480, 600,  768,  960];	// スクエア縦幅

設定["表示解像度初期番号"] = 1;
設定["表示解像度横幅リスト"] = [960, 1280, 1440, 1600];		// ワイド横幅
設定["表示解像度縦幅リスト"] = [540,  720,  810,  900];		// ワイド縦幅

設定["初期化シナリオ"] = "start";							// 省略時 = "start"
設定["初期化ラベル"] = "";									// 省略時 = ""
設定["ファンクションコールシナリオ"] = "function";		// 省略時 = "function"
設定["常設タイマのインターバル"] = 10;						// 省略時 = 10
設定["オリジナルマウスカーソル"] = "";						// 省略時 = ""(使用しない)
設定["RTO拡大縮小の補完方式"] = stFastLinear;				// 省略時 = stFastLinear
設定["確認ダイアログを使用する"] = true;					// 省略時 = false

// メニューバーのルートメニューの項目を列挙
設定["ルートメニューリスト"] = [							// 省略時 = メニューバーを使用しない
	"ファイル(&F)",
	"画面(&G)",
	"文字表示(&C)",
	"メッセージ(&M)",
	"サウンド(&S)",
	"その他(&O)"
];

// プラグインファイルのリストを列挙
設定["pluginファイルリスト"] = [							// 省略時 = 何も読み込まない
	"krmovie",
	"wuvorbis"
];
